# Pandas
*Pandas* is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

In [ ]:
import pandas as pd

## Series
`Series` is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a `Series` is to call:

In [10]:
fruits = pd.Series(["apple", "banana", "pear", "orange", "melon"], index=[5, 6, "sju", 8, 9])
fruits

5       apple
6      banana
sju      pear
8      orange
9       melon
dtype: object

In [21]:
fruits.apply(str.upper)

5       APPLE
6      BANANA
sju      PEAR
8      ORANGE
9       MELON
dtype: object

In [27]:
numbers = pd.Series([5, 7, 2])
numbers * 10

0    50
1    70
2    20
dtype: int64

In [13]:
numbers[numbers >= 5]

0    5
1    7
dtype: int64

In [ ]:
fruits[[True, True, False, False, True]]

## DataFrame
`DataFrame` is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of `Series` objects. It is generally the most commonly used pandas object. Like `Series`, `DataFrame` accepts many different kinds of input:

In [22]:
data = {
    "name": ["Anders", "Bertil", "Cecilia"],
    "age": [42, 29, 54]
}

df = pd.DataFrame(data)
df

      name  age
0   Anders   42
1   Bertil   29
2  Cecilia   54

In [23]:
data = [
    {"name": "Anders","age": 42},
    {"name": "Bertil", "age": 29},
    {"name": "Cecilia", "age": 54}
]

df = pd.DataFrame(data)
df

      name  age
0   Anders   42
1   Bertil   29
2  Cecilia   54

In [24]:
df["name"]

0     Anders
1     Bertil
2    Cecilia
Name: name, dtype: object

In [25]:
df["age"] = df["age"] + 1
df

      name  age
0   Anders   43
1   Bertil   30
2  Cecilia   55

In [31]:
df["age"] >= 50

0    False
1    False
2     True
Name: age, dtype: bool

In [28]:
df[df["age"] >= 50]

      name  age
2  Cecilia   55

In [33]:
str(df)

'      name  age\n0   Anders   43\n1   Bertil   30\n2  Cecilia   55'

In [34]:
print(df)

      name  age
0   Anders   43
1   Bertil   30
2  Cecilia   55